# VertexBuffer Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VertexBuffer Properties
VertexBuffer Class See Also
---
The VertexBuffer type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
VertexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace